KanatERPSukhova.КанатАдаптация/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3404cb9a-92ea-42b9-9086-ad481dbc27d7">
  <name>ДоговорыКонтрагентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>КАНАТ_ХранилищеИтоговыйТекст</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_ПоСоглашению</name>
    <type>
      <types>CatalogRef.СоглашенияСКлиентами</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="d4de0c91-22dd-4ce4-bc98-884061653165">
    <name>ГосударственныйКонтракт</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9b99d944-1b87-423e-a8a0-f6748f86530b">
    <name>НаименованиеДляПечати</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f56e0158-d692-474d-bb59-3cb9fe0131ae">
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ec175e6e-8a0f-46c1-8f61-1933ed068350">
    <name>ДоговорСУчастникомГОЗ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c2821c1b-dcf2-47d6-9871-b26fe7c33e1f">
    <name>Номер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a00d91d9-5c1d-491a-b338-92dc631c1afd">
    <name>Дата</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ba089968-9caa-4200-9002-b8f3267b4b61">
    <name>КонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6fe24eab-4e23-451e-8cae-c25d6e78e3df">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>КАНАТ_БлокиДоговора</name>
    <attributes>
      <name>БлокДоговора</name>
      <type>
        <types>CatalogRef.КАНАТ_БлокиДоговоров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

KanatERPSukhova.КанатАдаптация/src/Catalogs/ДоговорыКонтрагентов/ObjectModule.bsl
&После("ОбработкаЗаполнения")
Процедура КАНАТ_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//++ Гурьев 08.09.23
	УстановитьПривилегированныйРежим(Истина);
	БанковскийСчет = Константы.КАНАТ_ОсновнойСчетОрганизации.Получить();
	УстановитьПривилегированныйРежим(Ложь);
	//-- Гурьев 08.09.23
КонецПроцедуры

&После("ПередЗаписью")
Процедура КАНАТ_ПередЗаписью(Отказ)
	//++ Гурьев 18.09.23 ЧТЗ_2.15
	Если ПустаяСтрока(Номер) И Не Контрагент.Пустая() Тогда
		
		Номер = Справочники.ДоговорыКонтрагентов.КАНАТ_ПолучитьНомерПоШаблону(Ссылка, Контрагент);
		
	КонецЕсли;
	//-- Гурьев 18.09.23 ЧТЗ_2.15
	
	//++ Гурьев 25.10.23 ЧТЗ_2.15
	Наименование = СтрШаблон("Договор № %1 от %2",Номер, Формат(Дата,"ДФ=dd.MM.yyyy"));
	НаименованиеДляПечати = СтрШаблон("Договор № %1 от %2", Номер, Формат(Дата,"ДФ=dd.MM.yyyy"));
	//-- Гурьев 25.10.23 ЧТЗ_2.15

КонецПроцедуры

&После("ПриКопировании")
Процедура КАНАТ_ПриКопировании(ОбъектКопирования)
	//++ Гурьев 25.10.23 ЧТЗ_2.15
	Номер = ОбъектКопирования.Номер + " копия";
	//-- Гурьев 25.10.23 ЧТЗ_2.15
КонецПроцедуры
